[LWS_Stormrider X2SoldierClassTemplate]
+DisplayName="Stormrider"
+ClassSummary="Stormriders are fearsome melee combatants. They posses rage-fueled psionic powers that manifest as red lightning. They can break through toughest defense and form an impenetrable wall, all while effortlessly and graciously zapping around the battlefield."
+LeftAbilityTreeTitle="Rampage"
+RightAbilityTreeTitle="Run Through"
AbilityTreeTitles[0]="Rampage"
AbilityTreeTitles[1]="Run Through"
AbilityTreeTitles[2]="Unyielding"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="Pistols"

+RandomNickNames[0]="Slayer"
+RandomNickNames[1]="Lumberjack"
+RandomNickNames[2]="Gladiator"
+RandomNickNames[3]="Shatterer"
+RandomNickNames[4]="Spaniard"
+RandomNickNames[5]="Wrecker"
+RandomNickNames[6]="Ragnarok"
+RandomNickNames[7]="Havoc"
+RandomNickNames[8]="Ardent"
+RandomNickNames[9]="Fortress"
+RandomNickNames[10]="Devastator"
+RandomNickNames[11]="Proximo"
+RandomNickNames[12]="Claymore"
+RandomNickNames[13]="Raven"
+RandomNickNames[14]="Interceptor"
+RandomNickNames[15]="Raiden"
+RandomNickNames[16]="Hellion"
+RandomNickNames[17]="Swordsinger"
+RandomNickNames[18]="Defiant"
+RandomNickNames[19]="Shockblast"
+RandomNickNames[20]="Weissheim"
+RandomNickNames[21]="Razor"
+RandomNickNames[22]="Blitz"
+RandomNickNames[23]="Crackle"
+RandomNickNames[24]="Crimson"
+RandomNickNames[25]="Redrumm"
+RandomNickNames[26]="Shockerface"

RandomNickNames_Male[0]="Thor"
RandomNickNames_Male[1]="Thunderlord"
RandomNickNames_Male[2]="Axeman"
RandomNickNames_Male[3]="Magnus"


RandomNickNames_Female[0]="Valkyrie"
RandomNickNames_Female[1]="Scarlett"
RandomNickNames_Female[2]="Queenblade"
RandomNickNames_Female[3]="Shieldmaiden"